app/controllers/transactions_controller.rb

  def index
    @transactions = Transaction.all
---
SELECT "transactions".* FROM "transactions"

  def create
    @transaction = Transaction.new(transaction_params)

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("title", "body", "published", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hello"], ["body", "Aloha Nihao World"], ["published", false], ["created_at", "2022-03-22 20:53:04.143482"], ["updated_at", "2022-03-22 20:53:04.143482"]]

  def update
    respond_to do |format|
      if @transaction.update(transaction_params)
---
UPDATE "transactions" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "transactions"."id" = $4  [["title", "Zomg updated!"], ["body", "The updated ledger transaction..."], ["updated_at", "2022-03-22 20:02:47.605716"], ["id", 4]]

  def destroy
    @transaction.destroy
---
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 7]]

  def set_transaction
    @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]